## Plan Result (sbox-apim-appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw"
        name                              = "cft-apim00-sandbox-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (7 unchanged attributes hidden)

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "cft-api-mgmt-appgw.sandbox.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/httpListeners/cft-api-mgmt-appgw" -> null
          - name                           = "cft-api-mgmt-appgw" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = true -> null
          - ssl_certificate_id             = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/sslCertificates/wildcard-sandbox-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-sandbox-platform-hmcts-net" -> null
          - ssl_profile_id                 = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/sslProfiles/combined" -> null
          - ssl_profile_name               = "combined" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "cft-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "cft-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-sandbox-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }

      - ssl_profile {
          - id                               = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/sslProfiles/combined" -> null
          - name                             = "combined" -> null
          - trusted_client_certificate_names = [
              - "combine",
            ] -> null
          - verify_client_cert_issuer_dn     = true -> null
        }

      - trusted_client_certificate {
          - data = (sensitive value) -> null
          - id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/trustedClientCertificates/sandbox_root" -> null
          - name = "sandbox_root" -> null
        }
      - trusted_client_certificate {
          - data = (sensitive value) -> null
          - id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/trustedClientCertificates/combine" -> null
          - name = "combine" -> null
        }

        # (15 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1554,"Program":"tfcmt","SHA1":"","Target":"sbox-apim-appgw","Vars":{}} -->